; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v1 - type_3 ?v5 - type_1)
 	      (pred_3 ?v8 - object ?v5 - type_1)
	      (pred_1 ?v1 - type_3 ?v3 - type_2)
	      (pred_4 ?v1 - type_3 ?v8 - object ?v3 - type_2))

   (:action op_3
       :parameters  (?v1 - type_3 ?v6 ?v4 - type_1)
       :precondition (and  (pred_2 ?v1 ?v6))
       :effect (and  (pred_2 ?v1 ?v4)
		     (not (pred_2 ?v1 ?v6))))

   (:action op_1
       :parameters (?v1 - type_3 ?v2 - object ?v7 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_3 ?v2 ?v7) (pred_2 ?v1 ?v7) (pred_1 ?v1 ?v3))
       :effect (and (pred_4 ?v1 ?v2 ?v3)
		    (not (pred_3 ?v2 ?v7)) 
		    (not (pred_1 ?v1 ?v3))))

   (:action op_2
       :parameters (?v1 - type_3 ?v2 - object ?v7 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_4 ?v1 ?v2 ?v3) (pred_2 ?v1 ?v7))
       :effect (and (pred_3 ?v2 ?v7)
		    (pred_1 ?v1 ?v3)
		    (not (pred_4 ?v1 ?v2 ?v3)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_06 obj_10 - type_3
obj_12 obj_08 obj_13 obj_02 - type_2
obj_07 obj_14 obj_03 obj_09 - type_1
obj_01 obj_11 obj_04 obj_05 - object)
(:init
(pred_2 obj_06 obj_03)
(pred_1 obj_06 obj_12)
(pred_1 obj_06 obj_08)
(pred_2 obj_10 obj_07)
(pred_1 obj_10 obj_13)
(pred_1 obj_10 obj_02)
(pred_3 obj_01 obj_09)
(pred_3 obj_11 obj_09)
(pred_3 obj_04 obj_07)
(pred_3 obj_05 obj_07)
)
(:goal
(and
(pred_3 obj_01 obj_07)
(pred_3 obj_11 obj_09)
(pred_3 obj_04 obj_09)
(pred_3 obj_05 obj_09)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_06 obj_09) (pred_2 obj_10 obj_09))))
  )
)
)

; plan
1. (op_3 obj_06 obj_03 obj_07)
   deleted: (pred_2 obj_06 obj_03)
   added: (pred_2 obj_06 obj_07)
   goals met: 1 of 4
2. (op_1 obj_10 obj_05 obj_07 obj_02)
   deleted: (pred_3 obj_05 obj_07) (pred_1 obj_10 obj_02)
   added: (pred_4 obj_10 obj_05 obj_02)
   goals met: 1 of 4
3. (op_1 obj_10 obj_04 obj_07 obj_13)
   deleted: (pred_3 obj_04 obj_07) (pred_1 obj_10 obj_13)
   added: (pred_4 obj_10 obj_04 obj_13)
   goals met: 1 of 4
4. (op_3 obj_10 obj_07 obj_09)
   deleted: (pred_2 obj_10 obj_07)
   added: (pred_2 obj_10 obj_09)
   goals met: 1 of 4
5. (op_2 obj_10 obj_05 obj_09 obj_02)
   deleted: (pred_4 obj_10 obj_05 obj_02)
   added: (pred_3 obj_05 obj_09) (pred_1 obj_10 obj_02)
   goals met: 2 of 4
6. (op_2 obj_10 obj_04 obj_09 obj_13)
   deleted: (pred_4 obj_10 obj_04 obj_13)
   added: (pred_3 obj_04 obj_09) (pred_1 obj_10 obj_13)
   goals met: 3 of 4
7. (op_1 obj_10 obj_01 obj_09 obj_02)
   deleted: (pred_3 obj_01 obj_09) (pred_1 obj_10 obj_02)
   added: (pred_4 obj_10 obj_01 obj_02)
   goals met: 3 of 4
8. (op_3 obj_10 obj_09 obj_07)
   deleted: (pred_2 obj_10 obj_09)
   added: (pred_2 obj_10 obj_07)
   goals met: 3 of 4
9. (op_2 obj_10 obj_01 obj_07 obj_02)
   deleted: (pred_4 obj_10 obj_01 obj_02)
   added: (pred_3 obj_01 obj_07) (pred_1 obj_10 obj_02)
   goals met: 4 of 4
